[
  {
    "path": "posts/2024-10-13-creating-interactive-maps-in-r-with-tmap/",
    "title": "Creating interactive maps in R with tmap",
    "description": {},
    "author": [
      {
        "name": "Lisa Hefele",
        "url": {}
      }
    ],
    "date": "2024-08-31",
    "categories": [
      "Data visualization"
    ],
    "contents": "\r\nIn this tutorial, we will walk through how to create an interactive map of Laos and its neighboring countries using the tmap package in R. Tmap is a powerful tool for both static and interactive thematic maps. By the end of this tutorial, you will have a map you can zoom in and out of, showing Laos and its neighbors.\r\nStep 1: Install and load necessary packages\r\nFirst, we need to load the necessary libraries. We will use tmap for creating the map, sf for handling spatial data, and rnaturalearth to get country boundary data.\r\n\r\n\r\n# Install required packages if not already installed\r\n# install.packages(c(\"tmap\", \"tmaptools\", \"sf\", \"rnaturalearth\"))\r\n\r\n# Load the libraries\r\nlibrary(tmap)\r\nlibrary(tmaptools)\r\nlibrary(sf)\r\nlibrary(rnaturalearthdata)\r\n\r\n\r\nThe sf package is a widely-used tool for handling geographic data in R, while tmap allows us to create both static and interactive maps. Finally, we’ll use rnaturalearth to easily access Natural Earth’s open country boundary dataset.\r\nStep 2: Obtain the country boundaries\r\nNext, we will download and prepare the spatial data for the countries in our region of interest. The rnaturalearth package lets us pull country boundary data at different scales. For this tutorial, we’ll use the “medium” scale for a good balance between detail and file size.\r\n\r\n\r\n# Obtain the country boundaries\r\n# We will use rnaturalearth to download country boundary data\r\ncountries <- rnaturalearth::ne_countries(scale = \"medium\", returnclass = \"sf\")\r\n\r\n\r\nHere, the function ne_countries() fetches the spatial data for all the countries in the world.\r\nStep 3: Filter for Laos and the neighboring countries\r\nWe now need to focus on Laos and its neighboring countries. We will use the dplyr-like syntax provided by sf to filter out only the countries of interest: Laos, Vietnam, Thailand, Cambodia, China, and Myanmar.\r\n\r\n\r\n# Filter for Laos and its neighboring countries\r\n# Define a vector of countries of interest\r\ncountries_of_interest <- c(\"Laos\", \"Vietnam\", \"Thailand\", \"Cambodia\", \"China\", \"Myanmar\")\r\n\r\n# Filter the data to keep only those countries\r\nlaos_neighbors <- countries[countries$name %in% countries_of_interest, ]\r\n\r\n\r\nBy filtering the country boundaries data, we create a new dataset that contains only the geographic shapes of Laos and its neighbors. This keeps our map focused and less cluttered.\r\nStep 4: Create an interactive map\r\nNow it is time to build the interactive map! Tmap allows us to switch between static and interactive modes with tmap_mode(). By setting the mode to “view”, we can make the map interactive.\r\n\r\n\r\n# Create the interactive map\r\n# Set tmap mode to view (for interactive maps)\r\ntmap_mode(\"view\")\r\n\r\n# Create the map with tmap\r\ntm_shape(laos_neighbors) + \r\n  tm_polygons(\"name\", border.col = \"black\", lwd = 2) +  # Draw country borders\r\n  tm_text(\"name\", size = 0.7, col = \"darkblue\", auto.placement = TRUE) +  # Add country names\r\n  tm_style(\"classic\") +  # Use a classic map style\r\n  tm_basemap(\"OpenStreetMap\")  # Use OpenStreetMap as the background\r\n\r\n\r\n\r\nHere’s what happens in this step:\r\ntm_shape() specifies the geographic data we want to map (in this case, the countries of interest).\r\ntm_polygons() draws the polygons representing country borders and fills them.\r\ntm_text() adds country names directly on the map.\r\ntm_style() allows us to style the map. We use the “classic” style here.\r\ntm_basemap() adds an OpenStreetMap layer as the map background to give context and details to the geographic features.\r\nStep 5: Switching back to plot mode\r\nWhen working with multiple maps, it is useful to switch back to plot mode (for static maps) after you create an interactive map. This prevents other maps from being rendered interactively by default.\r\n\r\n\r\n# Switch back to plot mode after the interactive map\r\ntmap_mode(\"plot\")\r\n\r\n\r\nConclusion\r\nWith just a few lines of code, you can create an interactive map of Laos and its neighboring countries, giving you a dynamic tool for exploring geographic data. This method can be extended to any region or customized with additional layers, such as demographic or health data.\r\nNow you can experiment with different basemaps or country selections to fit your own data visualization needs!\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2024-10-13T21:05:50+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2024-05-05-paper-hcv/",
    "title": "High exposure to hepatitis C virus in Saravan, southern Laos: Identification of several risk practices",
    "description": {},
    "author": [
      {
        "name": "Lisa Hefele",
        "url": {}
      }
    ],
    "date": "2024-05-18",
    "categories": [
      "Research",
      "Publications"
    ],
    "contents": "\r\nHepatitis C Virus risk factors study in Southern Laos\r\nIn a follow-up study conducted in Samuoi district, Saravan province, southern Laos, we investigated the prevalence and risk factors of hepatitis C virus (HCV) infection. Our findings revealed a high seropositivity rate, with 39.8% of participants testing positive for HCV antibodies. Notably, non-sterile medical practices, including the use of re-used syringes (72.5%) and unlicensed parenteral treatments (58%), were common. Tattoos and accidental blood exposure were significantly associated with HCV infection. This study underscores the urgent need for community-wide HCV testing and awareness campaigns to reduce transmission risks. Further viral sequencing is ongoing to enhance our understanding of HCV epidemiology in the region.\r\nFor more details, you can access the full paper here.\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2024-10-13T12:36:56+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2024-05-05-paper-mics/",
    "title": "Factors associated with hepatitis B vaccination in Laos: findings from the multiple indicator cluster surveys in 2011/12 and 2017",
    "description": {},
    "author": [
      {
        "name": "Lisa Hefele",
        "url": {}
      }
    ],
    "date": "2024-05-05",
    "categories": [
      "Research",
      "Publications"
    ],
    "contents": "\r\nHighlights\r\nThis study uses data from the most recent multiple indicator cluster survey (MICS) which is designed to provide comprehensive data on child and maternal health. The data is nationally representative. We provide relevant information regarding hepatitis B vaccination coverage rates in Laos in children under two years of age and investigated demographic and socioeconomic factors that affect hepatitis B vaccination coverage rates.\r\nFor more details, you can access the full paper here.\r\nThe code supporting the article can be found here.\r\n\r\n\r\n\r\nFigure 1: Estimated hepatitis B vaccination coverage in Laos (weighted proportions) among children. For the combination vaccines in 2011/12, we did not distinguish between the numbers of doses received. The map was created in R (see supplement information). The shapefiles containing the administrative boundaries of Lao PDR from 2012 were obtained from the International Steering Committee for Global Mapping (retrieved from https://maps.princeton.edu/catalog/stanford-cp768st2071). The shapefiles containing the administrative boundaries of the Laos in 2017 were obtained from the Humanitarian Data Exchange website (https://data.humdata.org/dataset/lao-admin-boundaries, dataset provided by the National Geographic Department of Lao PDR, 2019). Projection used: EPSG 4326 –WGS 84. Reprinted with permission from Dekker et al., 2024\r\n\r\n\r\n\r\nAbstract\r\nBackground\r\nWithin Laos, the vaccination coverage rates with the monovalent hepatitis B birth dose vaccine and hepatitis B antigen-containing combination vaccines remain stagnant with 75% and 64%, respectively, in 2021. In this study, we used data from the Multiple Indicator Cluster Surveys to identify possible factors that represent barriers for receiving these childhood vaccinations.\r\nMethods\r\nData from the Multiple Indicator Cluster Surveys in 2011/12 and 2017 were analysed to examine factors associated with receiving the hepatitis B-containing vaccines using regression modelling. Data analyses were conducted in R.\r\nFindings\r\nIn 2011/12, the weight-adjusted coverage rate for receiving the hepatitis B birth dose was 48%, while the coverage with the hepatitis B antigen-containing combination vaccine was 55.1% based on both vaccination documents and recall; compared to 69.3% and 59.4% respectively in 2017. Ethno-linguistic group, maternal education, healthcare utilization and wealth were associated with receiving the vaccinations against hepatitis B.\r\nInterpretation\r\nNational estimates of vaccination coverage rates can conceal country-specific regional or socio-economic variations. Children from Hmong-Mien households, from less wealthier households and whose mothers were less educated and were not able to or did not utilize healthcare were identified as being less likely to receive the vaccinations. These findings indicate the need for improving access to healthcare, in particular for minority groups.\r\n\r\n\r\n\r\n",
    "preview": "posts/2024-05-05-paper-mics/map-hepb-vac.jpg",
    "last_modified": "2024-10-13T11:43:28+02:00",
    "input_file": {}
  }
]
